In [4]:
import pandas as pd
series = pd.Series([2500,3000,4000,5000], index = ["apple",'banana','mango','tomato'])
series

apple     2500
banana    3000
mango     4000
tomato    5000
dtype: int64

In [5]:
series.values

array([2500, 3000, 4000, 5000], dtype=int64)

In [6]:
series.values()

TypeError: 'numpy.ndarray' object is not callable

In [10]:
fruit_series = pd.Series([2500,3000,4000,5000],index = ["apple",'banana','mango','tomato'])
fruit_series

apple     2500
banana    3000
mango     4000
tomato    5000
dtype: int64

In [11]:
fruit_series

apple     2500
banana    3000
mango     4000
tomato    5000
dtype: int64

In [13]:
fruit_series.name = "fruit_menu"

In [14]:
fruit_series

apple     2500
banana    3000
mango     4000
tomato    5000
Name: fruit_menu, dtype: int64

In [35]:
fruit_catalog = pd.DataFrame({
    "fruit_name" : ['apple','banana','tomato','mango'],
    "fruit_price" : [2000,3000,4000,2500],
    "fruit_qty" : [3,10,5,7]
})

SyntaxError: invalid syntax (<ipython-input-35-583d52ef72e1>, line 2)

In [16]:
fruit_status = pd.Series([
    "good","bad","bad","good"
])
fruit_status

0    good
1     bad
2     bad
3    good
dtype: object

In [18]:
fruit_catalog['fruit_status'] = fruit_status

In [19]:
fruit_catalog

  fruit_name  fruit_price  fruit_qty fruit_status
0      apple         2000          3         good
1     banana         3000         10          bad
2     tomato         4000          5          bad
3      mango         2500          7         good

In [21]:
fruit_catalog2 = fruit_catalog.drop([2])
fruit_catalog2

  fruit_name  fruit_price  fruit_qty fruit_status
0      apple         2000          3         good
1     banana         3000         10          bad
3      mango         2500          7         good

In [30]:
fruit_name = fruit_catalog['fruit_name']
fruit_catalog3 = pd.DataFrame(fruit_catalog, index = fruit_name, columns=['fruit_price','fruit_qty','fruit_status'])

In [32]:
type(fruit_catalog)

pandas.core.frame.DataFrame

In [33]:
fruit_catalog3 = pd.DataFrame(fruit_catalog, index = fruit_name)

In [34]:
fruit_catalog3

           fruit_name  fruit_price  fruit_qty fruit_status
fruit_name
apple             NaN          NaN        NaN          NaN
banana            NaN          NaN        NaN          NaN
tomato            NaN          NaN        NaN          NaN
mango             NaN          NaN        NaN          NaN

In [45]:
fruit = pd.Series([2500,3000,1200,6000], index = ['apple','banana','mango','tomato'])

In [46]:
fruit['apple':'mango']

apple     2500
banana    3000
mango     1200
dtype: int64

In [78]:
fruit_data = pd.DataFrame(fruit)

In [79]:
fruit_data['fruit_qty']=[4,5,10,9]
fruit_data['fruit_status']=['good','bad','bad','good']

In [80]:
fruit_data.columns = ['fruit_price','fruit_qty','fruit_status']

In [81]:
fruit_data

        fruit_price  fruit_qty fruit_status
apple          2500          4         good
banana         3000          5          bad
mango          1200         10          bad
tomato         6000          9         good

In [82]:
fruit_size = pd.Series(['small','not_small','medium','not_small'],index=['tomato','mango','banana','apple'])
fruit_data['fruit_size']=fruit_size
fruit_data

        fruit_price  fruit_qty fruit_status fruit_size
apple          2500          4         good  not_small
banana         3000          5          bad     medium
mango          1200         10          bad  not_small
tomato         6000          9         good      small

In [83]:
new_fruit = [4000,15,'good','medium']
fruit_data.loc['grape']=new_fruit

In [68]:
fruit_data

        fruit_price  fruit_qty fruit_status fruit_size
apple          2500          4         good  not_small
banana         3000          5          bad     medium
mango          1200         10          bad  not_small
tomato         6000          9         good      small
grape          4000         15         good     medium

In [70]:
fruit_grape=fruit_data.drop('grape')
fruit_grape

        fruit_price  fruit_qty fruit_status fruit_size
apple          2500          4         good  not_small
banana         3000          5          bad     medium
mango          1200         10          bad  not_small
tomato         6000          9         good      small

In [84]:
fruit_data2 = fruit_data.drop('fruit_size',axis=1)

In [86]:
fruit_data2

        fruit_price  fruit_qty fruit_status
apple          2500          4         good
banana         3000          5          bad
mango          1200         10          bad
tomato         6000          9         good
grape          4000         15         good

In [87]:
fruit_data.sort_values(by=['fruit_size'])

        fruit_price  fruit_qty fruit_status fruit_size
banana         3000          5          bad     medium
grape          4000         15         good     medium
apple          2500          4         good  not_small
mango          1200         10          bad  not_small
tomato         6000          9         good      small

In [89]:
fruit_data.sort_values(by=['fruit_status'],ascending=False)

        fruit_price  fruit_qty fruit_status fruit_size
apple          2500          4         good  not_small
tomato         6000          9         good      small
grape          4000         15         good     medium
banana         3000          5          bad     medium
mango          1200         10          bad  not_small